#### Import Libraries

In [1]:
import pandas as pd
import numpy as np
from itertools import product
from sentence_transformers import SentenceTransformer, util
from tqdm import tqdm
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.cluster import KMeans
from sklearn.decomposition import PCA
import matplotlib.pyplot as plt
import torch
from sklearn.decomposition import TruncatedSVD

/Users/susanliang/opt/anaconda3/envs/nlp/lib/python3.12/site-packages/sentence_transformers/cross_encoder/CrossEncoder.py:13: TqdmExperimentalWarning: Using `tqdm.autonotebook.tqdm` in notebook mode. Use `tqdm.tqdm` instead to force console mode (e.g. in jupyter console)
  from tqdm.autonotebook import tqdm, trange

In [2]:
qs_ranking = pd.read_csv('./young_company/qs_rank_2024.csv', index_col=0)
different_rows = pd.read_csv('institutions_full.csv', header= None)
different_rows = different_rows.rename(columns={0: "index", 1: "institution_name"})

#### University Mapping

##### this section first clean the QS university table and then map the university to the standard QS university name.

In [3]:
raw_rank = pd.read_excel("2024 QS World University Rankings 1.2 (For qs.com) copy.xlsx")
raw_rank.columns = [None] * raw_rank.shape[1]
raw_rank = raw_rank.drop(index=[0, 1])
raw_rank = raw_rank.reset_index()
new_header = raw_rank.iloc[0] 
raw_rank = raw_rank[1:] 
raw_rank.columns = new_header 
raw_rank = raw_rank.drop(columns=[2, 'rank display2','location code'])
raw_rank = raw_rank.rename(columns={"rank display": "rank_2024"})
raw_rank = raw_rank.iloc[:, :3]
raw_rank['institution'] = raw_rank['institution'].str.replace(r'\s*\(.*\)', '', regex=True)
raw_rank = raw_rank.replace(r'[=+]', '', regex=True)
raw_rank['rank_2024'] = raw_rank['rank_2024'].astype(str)
def convert_to_numeric(value):
    if '-' in value:
        start, end = map(int, value.split('-'))
        return (start + end) / 2
    else:
        return int(value)

raw_rank['rank_2024'] = raw_rank['rank_2024'].apply(convert_to_numeric).astype(int)
qs_ranking = raw_rank

In [4]:
different_rows['Best Match'] = None
different_rows = different_rows.astype(str)
different_rows = different_rows[different_rows['Best Match'] == 'None']

sample_university_names = different_rows[different_rows['Best Match'] == 'None']['institution_name'].tolist()
qs_standard_names = qs_ranking['institution'].tolist()
# Load the Sentence-BERT model
model = SentenceTransformer('paraphrase-MiniLM-L6-v2')
qs_embeddings = model.encode(qs_standard_names, convert_to_tensor=True) # create embeddings for QS standard names

# Function to find the best match for each name based on cosine similarity
def match_with_embeddings(name, qs_names, qs_embeddings, threshold=0.6):
    name_embedding = model.encode(name, convert_to_tensor=True)
    # Compute cosine similarity between the name and each QS name
    similarities = util.cos_sim(name_embedding, qs_embeddings)[0]
    best_score = torch.max(similarities).item()
    best_match_idx = torch.argmax(similarities).item()
    best_match = qs_names[best_match_idx] if best_score >= threshold else None
    return best_match

semantic_matches = {}
for name in tqdm(sample_university_names, desc="Matching university names"):
    semantic_matches[name] = match_with_embeddings(name, qs_standard_names, qs_embeddings)

print(semantic_matches)

different_rows = different_rows.astype(str)
different_rows = different_rows[different_rows['Best Match'] != 'None']

matches_df = pd.DataFrame.from_dict(semantic_matches, orient='index', columns=['Best Match'])
matches_df.index.name = 'institution_name' 
matches_df.reset_index(inplace=True)
# matches_df.to_excel('BERT_matches_dfv2.xlsx')
matches_df = pd.DataFrame.from_dict(semantic_matches, orient='index', columns=['Best Match'])
matches_df.index.name = 'institution_name' 
matches_df.reset_index(inplace=True)

Matching university names: 100%|██████████| 3575/3575 [00:55<00:00, 64.76it/s]

{'Birla Institute of Technology and Science, Pilani': 'Birla Institute of Technology and Science, Pilani', 'Dartmouth College': 'Dartmouth College', 'The Open University': 'The Australian National University', 'The University of Exeter': 'The University of Exeter', 'Stanford University': 'Stanford University', 'Brown University': 'Brown University', 'University of Connecticut': 'University of Connecticut', 'London School of Economics and Political Science': 'The London School of Economics and Political Science', 'Rice University': 'Rice University', 'California Institute of Technology': 'California Institute of Technology', 'Duke University': 'Duke University', 'Y Combinator': None, 'University of California, Berkeley': 'University of California, Berkeley', 'High School': 'The New School', 'Oakland Military Institute': None, 'V. N. Karazin Kharkiv National University': 'V. N. Karazin Kharkiv National University', 'Mississippi Gulf Coast Community College': 'Mississippi State University', 'University of California, San Diego': 'University of California, San Diego', 'City University of Hong Kong': 'City University of Hong Kong', 'Politecnico di Milano': 'Politecnico di Milano', 'University of California, Irvine': 'University of California, Irvine', 'Indian Institute of Technology, Guwahati': 'Indian Institute of Technology Guwahati', 'University of Minnesota': 'University of Minnesota Twin Cities', 'Harvard Business School Online': 'Harvard University', 'Syracuse University': 'Syracuse University', 'Princeton University': 'Princeton University', 'University of Michigan-Ann Arbor': 'University of Michigan-Ann Arbor', 'The Harker School': 'The New School', 'Harvard University': 'Harvard University', 'University of Colorado Boulder': 'University of Colorado Boulder', 'University of Pittsburgh': 'University of Pittsburgh', 'University College London': 'London Metropolitan University', 'National University of Singapore': 'National University of Singapore', 'Georgia Institute of Technology': 'Georgia Institute of Technology', 'Columbia University': 'Columbia University', 'University of Pennsylvania': 'University of Pennsylvania', 'Nichols School': 'University of Idaho', 'Carnegie Mellon University': 'Carnegie Mellon University', 'Coursera': None, 'Yale University': 'Yale University', 'Universidad Iberoamericana, Ciudad de México': 'Universidad Anáhuac México', 'Vista hermosa': None, 'Universidad Iberoamericana': 'Universidad Iberoamericana IBERO', 'The University of Auckland': 'The University of Auckland', 'Stanford University Graduate School of Business': 'Stanford University', 'Bellarmine College Preparatory': 'Emory University', 'Nanyang Technological University, Singapore': 'Nanyang Technological University, Singapore', 'University of Waterloo': 'University of Waterloo', 'University of Illinois at Urbana-Champaign': 'University of Illinois at Urbana-Champaign', 'UC Berkeley College of Engineering': 'University of California, Berkeley', 'University of Oxford': 'University of Oxford', 'The University of Georgia': 'The University of Georgia', "St. Columba's School": None, 'Rochester Institute of Technology': 'Rochester Institute of Technology', 'Imperial College London': 'Imperial College London', 'IIT Bombay': 'Indian Institute of Technology Bombay', 'University of Madras': 'University of Madras', 'Tuck School of Business at Dartmouth': 'Dartmouth College', 'Savitribai Phule Pune University': 'Savitribai Phule Pune University', 'National Institute of Technology Tiruchirappalli': 'National Institute of Technology Tiruchirappalli', 'Kendriya Vidyalaya': 'Universitas Muhammadiyah Yogyakarta', 'Birla Institute of Technology': 'Birla Institute of Technology and Science, Pilani', 'The Hotchkiss School': 'The New School', 'Northwestern University': 'Northwestern University', 'University of Texas at Austin': 'University of Texas at Austin', 'Aarhus University': 'Aarhus University', 'IT': None, 'Tufts University': 'Tufts University', 'Belarusian State University': 'Belarusian State University', 'Dhirubhai Ambani International School': 'Sabanci University', 'Harvard Business School': 'Harvard University', 'IIT Delhi': 'Indian Institute of Technology Delhi', 'National Institute of Technology, Kurukshetra': 'National Institute of Technology Tiruchirappalli', 'IIT Roorkee': 'Indian Institute of Technology Roorkee', 'State Engineering University of Armenia': 'Yerevan State University', 'Carnegie Mellon University College of Engineering': 'Carnegie Mellon University', 'The University of Queensland': 'The University of Queensland', 'Humber College': None, 'Tecnológico de Monterrey': 'Tecnológico de Monterrey', 'Royal Holloway University of London': 'Royal Holloway University of London', 'HEC Paris': None, 'HKUST Business School': 'Hongik University ', 'Ivey Business School at Western University': 'Western University', 'Claremont Colleges': 'Fordham University ', 'The University of British Columbia': 'University of British Columbia', 'Rock Health': None, 'Michigan State University': 'Michigan State University', 'University of San Diego': 'University of San Diego', 'CentraleSupélec': None, 'Ecole normale supérieure': 'École Normale Supérieure de Lyon', 'Simon Fraser University': 'Simon Fraser University', 'Waseda University': 'Waseda University', 'Manchester Metropolitan University': 'Manchester Metropolitan University', 'University of Alberta': 'University of Alberta', 'University of Washington': 'University of Washington', 'University of Southern California': 'University of Southern California', 'Purdue University': 'Purdue University', "Queen's University Belfast": "Queen's University Belfast", 'University of Cambridge': 'University of Cambridge', 'College of Engineering Trivandrum': 'University of Tyumen', 'IIT Kanpur': 'Indian Institute of Technology Kanpur', 'Jawahar Navodaya Vidyalaya, Birauli, Samastipur': 'Universitas Muhammadiyah Yogyakarta', 'Kendriya Vidyala, Andrews Ganj': 'Universitas Muhammadiyah Yogyakarta', 'Guru Gobind Singh Indraprastha University': 'Guru Gobind Singh Indraprastha University', 'RV College Of Engineering': 'University of Engineering & Technology Lahore', 'Indian School of Business': 'Indian Institute of Technology Kanpur', 'IE Business School': 'IE University', 'Pondicherry University': 'Pondicherry University', 'Pondicherry Engineering College': 'Pondicherry University', "St. Joseph's Convent School, Pathankot": None, 'Stanford Continuing Studies': 'Stanford University', 'International Institute of Information Technology': 'Illinois Institute of Technology', 'Indian Institute of Science': 'Indian Institute of Science', 'University of Toronto': 'University of Toronto', 'Strathcona': 'University of Strathclyde', 'Crescent School': 'The New School', 'University of Ottawa': 'University of Ottawa', 'Institut National des Sciences Appliquées de Lyon': 'Institut National des Sciences Appliquées de Lyon', 'Nottingham': 'University of Nottingham', 'New York University': 'New York University', 'Gordonstoun School': 'Robert Gordon University', 'Newcastle University': 'Newcastle University', 'Lycee International de St. Germain': None, 'FGV - Fundação Getulio Vargas': 'Fundación CEU San Pablo', 'Colégio Bandeirantes': 'Colegio de México', 'Massachusetts Institute of Technology': 'Massachusetts Institute of Technology ', 'Ecole Centrale Paris': 'Université Sorbonne Paris Nord', 'Taras Shevchenko National University of Kyiv': 'Taras Shevchenko National University of Kyiv', 'Norwegian University of Life Sciences': 'Norwegian University of Life Sciences', 'CUNY Hunter College': 'CUNY The City College of New York', 'Rigas Tehniska Universitate': 'Universität Leipzig', 'Université de Technologie de Belfort-Montbéliard': 'De Montfort University', 'ESMT': None, 'UTBM': None, 'San Jose State University': 'San Francisco State University', 'Cornell University': 'Cornell University', 'Indiana University Bloomington': 'Indiana University Bloomington', 'Williams College': 'Howard University', 'Commercial Real Estate': None, 'Penn State University': 'Pennsylvania State University', 'University College Cork': 'University College Cork', 'University of New Hampshire': 'University of New Hampshire', 'California College of the Arts': 'University of Southern California', 'University of Chicago': 'University of Chicago', 'Clemson University': 'Clemson University', 'The George Washington University': 'George Washington University', 'University of Oregon': 'University of Oregon', 'The Heiden Institute of Jerusalem': 'The Hebrew University of Jerusalem', 'Harvard Law School': 'Harvard University', 'Cornell University College of Engineering': 'Cornell University', 'Queensland University of Technology': 'Queensland University of Technology', 'London Business School': 'City, University of London', 'Weizmann Institute of Science': None, 'Bar-Ilan University': 'Bar-Ilan University', 'Interdisciplinary Center Herzliya': 'Universität Konstanz', 'Harvard Graduate School of Arts and Sciences': 'Harvard University', 'The Hebrew University of Jerusalem': 'The Hebrew University of Jerusalem', 'Université de Montréal ': 'Université de Montréal ', 'Lycée Sainte Geneviève': None, 'Obafemi Awolowo University,Ile-Ife': 'Erciyes Üniversitesi', 'Management and Science University': 'Management and Science University', 'The University of Arizona': 'The University of Arizona', 'Tekedia Institute': None, 'University of Ilorin': 'University of Trieste', 'Emory University': 'Emory University', 'Obafemi Awolowo University': 'Airlangga University', 'Garden Institute of Business and Entrepreneurship': 'International University of Business, Agriculture and Technology', "St. James' School, Kolkata": 'University of Calcutta', 'Delhi Public School, R.K.Puram, New Delhi': 'University of Delhi', 'Management Development Institute': 'Lahore University of Management Sciences', 'SGH Warsaw School of Economics': 'Athens University of Economics and Business', 'Indian Institute of Technology Varanasi': 'Indian Institute of Technology Varanasi', 'Management Development Institute, Gurgaon': 'Lahore University of Management Sciences', 'California State University - Los Angeles': 'California State University - Los Angeles', 'Middlesex University': 'Middlesex University', "Ecole internationale des Sciences du Traitement de l'Information": None, 'SKEMA Bachelor': None, 'Faculty of Automatic Control and Computer Science at Politehnica University of Bucharest': None, 'University of Bucharest': 'University of Bucharest', 'National Institute of Technology, Tiruchirappalli': 'National Institute of Technology Tiruchirappalli', 'Eton College': 'Imperial College London', 'Havard Business School': None, 'BITS Pilani': None, 'Pune Institute of Computer Technology': 'Indian Institute of Technology Hyderabad', 'University of Technology Sydney': 'University of Technology Sydney', 'INSEAD': None, 'Northern Virginia Community College': 'University of Virginia', 'Keene State College': 'Mississippi State University', 'Prépa Joffre MP': None, 'Télécom Paris': None, 'University of Nottingham': 'University of Nottingham', 'Universidad Autónoma de Madrid': 'Universidad Autónoma de Madrid', 'Universidad Politécnica de Madrid': 'Universidad Politécnica de Madrid', 'Kungliga tekniska högskolan': None, 'Grenoble Ecole de Management': 'Universidad del Desarrollo', 'National University of Science and Technology \\MISIS\\"\xa0 (Moscow Institute of Steel and Alloys)"': 'The National University of Science and Technology MISIS', "O'Reilly School of Technology": 'Rochester Institute of Technology', 'DePaul University': 'University of Deusto', 'National University of Shipbuilding (Ukraine)': 'University of Hull', 'National University of Shipbuilding': None, 'ITESO': None, 'IPADE Business School': None, 'University of Massachusetts Amherst': 'University of Massachusetts Amherst', 'University of Delaware': 'University of Delaware', 'Latvijas Universitate': None, 'Uniiversidad ICESI': 'Universidad ICESI', 'University of Rochester': 'University of Rochester', 'Colegio Alemán de Barranquilla': 'Colegio de México', 'Universidad del Norte': 'Universidad del Norte ', 'Montpellier Business School': 'Université de Montpellier', 'University of Wisconsin-Madison': 'University of Wisconsin-Madison', 'Drexel University': 'Drexel University', 'NIT Raipur': 'Indian Institute of Technology Kanpur', 'Georgia Tech': 'Georgia State University', 'Universidad Nacional de Córdoba - UNC': 'Universidad Nacional de Córdoba - UNC', 'Universitat Politècnica de Catalunya · BarcelonaTech': 'Universitat Politècnica de Catalunya · BarcelonaTech', 'Universidad de Santiago de Chile': 'Universidad de Santiago de Chile', 'ITBA': None, "Universidad Empresarial 'Siglo 21'": 'Universidade Estadual de Londrina', 'Católica de Córdoba': 'Católica de Córdoba', 'Harvard University Kennedy School of Government': 'Harvard University', 'United World College South East Asia': 'Ritsumeikan Asia Pacific University', 'Air University': 'Ufa State Aviation Technical University ', 'Yunnan Nationalities University': 'Zhejiang University', 'Bates College': None, 'Banha University': 'Banaras Hindu University', 'CFA Institute': None, 'John Molson School of Business, Concordia, Montreal': 'Université de Montréal ', 'The American University in Cairo': 'The American University in Cairo', 'Lycée Jean Perrin': None, 'Business Administration': None, 'Computer Science': 'University of Electronic Science and Technology of China', 'German University in Cairo': 'German University in Cairo', 'Universität Hamburg': 'Universität Hamburg', 'International School of Choueifat, UAE': 'United Arab Emirates University', 'El Shorouk Academy': None, 'University of North Carolina, Chapel Hill': 'University of North Carolina, Chapel Hill', 'The University of Manchester': 'The University of Manchester', 'The University of Warwick': 'The University of Warwick', 'University of Virginia': 'University of Virginia', 'Chatham Kent Secondary School': 'Kent State University', 'ISN': None, 'University of Brighton': 'University of Brighton', 'Center for Digital Technology and Management': None, 'Technical University of Munich': 'Technical University of Munich', 'Tsinghua University': 'Tsinghua University', 'RWTH Aachen University': 'RWTH Aachen University', 'University of South Australia': 'University of South Australia', 'California Polytechnic State University': 'California Polytechnic State University', 'Abasaheb Garware Science College': 'Swinburne University of Technology', 'Amrita University': 'Waseda University', 'Farnborough 6th Form College': None, 'Massachusetts Institute of Techonology': 'Massachusetts Institute of Technology ', 'IIT Madras': 'Indian Institute of Technology Madras', 'Northumbria University': 'Northumbria University at Newcastle', 'Colegio AlemÃ¡n de Santiago': 'Universidad Católica de Santiago de Guayaquil', 'Colegio Suizo de Santiago': 'Colegio de México', 'Colegio Alemán de Santiago': 'Colegio de México', 'Vanderbilt University': 'Vanderbilt University', 'North Carolina State University': 'North Carolina State University', 'Florida Atlantic University - Boca Raton': 'Florida Atlantic University - Boca Raton', 'University of Florida': 'University of Florida', 'Loyola School Jamshedpur': 'Loyola University Chicago', 'Shri Ram College of Commerce': 'Manipal Academy of Higher Education, Manipal, Karnataka, India', 'Indian Institute of Management, Ahmedabad': 'Indian Institute of Technology Hyderabad', 'Delhi Public School - R. K. Puram': 'University of Delhi', 'McGill University': 'McGill University', 'University of Missouri, Columbia': 'University of Missouri, Columbia', 'Northumbria University (UK)': 'Northumbria University at Newcastle', "St. Xavier's College, Mumbai": 'University of Mumbai', 'Boğaziçi University': 'Boğaziçi University', 'Robert Gordon University': 'Robert Gordon University', 'The University of Edinburgh': 'The University of Edinburgh', 'University of St Andrews': 'University of St Andrews', 'Rutgers University': 'Rutgers University–Newark', 'Birla Institute of Technology and Science, Pilani (BITS Pilani)': 'Birla Institute of Technology and Science, Pilani', 'Campion School, Bhopal': None, 'IIT Kharagpur': 'Indian Institute of Technology Kharagpur', 'Rensselaer Polytechnic Institute': 'Rensselaer Polytechnic Institute', 'Stevens Institute of Technology': 'Stevens Institute of Technology', 'M.I.T , Manipal': None, 'University of Maryland, Baltimore County': 'University of Maryland, Baltimore County', 'Amherst College': 'University of Massachusetts Amherst', 'Aleppo University': 'Damascus University', 'Startup School Online': None, 'Grinnell College': None, 'Institute of Business Management': 'Lahore University of Management Sciences', 'Cardiff University': 'Cardiff University', 'National Institute of Technology Trichy': 'California Institute of Technology', 'Zurich International School': 'University of Zurich', 'Wake Forest University': 'Wake Forest University', 'St. Anselms School': 'The New School', 'DAV Public School': None, 'Chalmers University of Technology': 'Chalmers University of Technology', 'Göteborgs Tekniska Institut': 'University of Gothenburg', 'Brigham Young University': 'Brigham Young University', 'Diablo Valley College': None, 'UCLA Anderson School of Management': 'Management and Science University', 'University of California, San Francisco': 'University of San Francisco', 'ITAM': None, 'University of Minnesota Twin Cities': 'University of Minnesota Twin Cities', 'ITESM': None, 'The Ohio State University': 'The Ohio State University', 'Mahatma Gandhi University': 'Jawaharlal Nehru University', 'Universidade Federal de Minas Gerais': 'Universidade Federal de Minas Gerais      ', 'Instituto Federal de Educação, Ciência e Tecnologia de Minas Gerais - IFMG': 'Universidade Federal de Minas Gerais      ', 'Universidad de Guadalajara': 'Universidad de Guadalajara', 'Universitat Autònoma de Barcelona': 'Universitat Autònoma de Barcelona', 'Università Cattolica del Sacro Cuore': 'Università\xa0Cattolica del Sacro Cuore', 'EDHEC Business School': None, 'University of California, Berkeley, Haas School of Business': 'University of California, Berkeley', 'Universidad ORT Uruguay': 'Universidad ORT Uruguay', 'Universidad Francisco de Vitoria': 'Universidad de Talca', 'Bachillerato Ánahuac de Monterrey': 'Tecnológico de Monterrey', 'Instituto Irlandés de Monterrey': 'Universidad de Monterrey', 'Colegio Menor': None, 'Boston College': 'Boston College', 'Lycée Français Jean Mermoz': None, 'Universidad de Buenos Aires': 'Universidad de Buenos Aires', 'Insper': None, 'Graded School of São Paulo': 'Universidade de São Paulo', 'Univerza v Mariboru': 'University of Maribor', 'Jyväskylän yliopisto': None, 'ULB': None, 'University of Leeds': 'University of Leeds', 'Kellogg Executive Education': None, 'Ludwig Maximilian University of Munich': 'Ludwig-Maximilians-Universität München', 'Cégep Limoilou': None, 'Université de Sherbrooke': 'Université de Sherbrooke', "Seth Godin's alternative MBA": None, 'Saint Lawrence University': 'University of Plymouth', 'Babson College - Franklin W. Olin Graduate School of Business': None, 'Salisbury School': 'University of Bradford', 'Paris School of Economics': 'The London School of Economics and Political Science', 'University of Alicante': 'University of Alicante', 'KTH Royal Institute of Technology': 'KTH Royal Institute of Technology ', 'University of East Anglia': 'University of East Anglia', 'Sciences Po': 'Sciences Po ', 'Le Wagon': None, 'Academy of Art University': 'Ajman University', 'University of Otago': 'University of Otago', 'University of California, Santa Barbara': 'University of California, Santa Barbara', 'CIV - International Center of Valbonne': None, 'EPITA': None, "EPF Ecole d'Ingénieurs": 'Universidade Nova de Lisboa', 'Colegio Nueva Granada': 'Colegio de México', 'Colegio de Estudios Superiores de Administración

##### this section generate SQL statements which can be directly copy-paste into mysql. The mapping output version currently being used for mysql scripts are further being revised manually to ensure there is no meaningless mapping. However, for the sake of workflow, the mapping result is directly translated into mysql code without further manual verification.

In [64]:
update_statements = []
matches_df = matches_df.astype(str)
for _, row in matches_df.iterrows():
    new_name = row['Best Match'].replace("'", "''")  # Handle single quotes
    old_name = row['institution_name'].replace("'", "''")   # Handle single quotes
    sql = f"UPDATE young_company.institutions SET institution_name = '{new_name}' WHERE institution_name = '{old_name}';"
    update_statements.append(sql)

sql_updates = "\n".join(update_statements)
print("Generated SQL UPDATE statements:")
print(sql_updates)

Generated SQL UPDATE statements:
UPDATE young_company.institutions SET institution_name = 'Birla Institute of Technology and Science, Pilani' WHERE institution_name = 'Birla Institute of Technology and Science, Pilani';
UPDATE young_company.institutions SET institution_name = 'Dartmouth College' WHERE institution_name = 'Dartmouth College';
UPDATE young_company.institutions SET institution_name = 'The Australian National University' WHERE institution_name = 'The Open University';
UPDATE young_company.institutions SET institution_name = 'The University of Exeter' WHERE institution_name = 'The University of Exeter';
UPDATE young_company.institutions SET institution_name = 'Stanford University' WHERE institution_name = 'Stanford University';
UPDATE young_company.institutions SET institution_name = 'Brown University' WHERE institution_name = 'Brown University';
UPDATE young_company.institutions SET institution_name = 'University of Connecticut' WHERE institution_name = 'University of Connecticut';
UPDATE young_company.institutions SET institution_name = 'The London School of Economics and Political Science' WHERE institution_name = 'London School of Economics and Political Science';
UPDATE young_company.institutions SET institution_name = 'Rice University' WHERE institution_name = 'Rice University';
UPDATE young_company.institutions SET institution_name = 'California Institute of Technology' WHERE institution_name = 'California Institute of Technology';
UPDATE young_company.institutions SET institution_name = 'Duke University' WHERE institution_name = 'Duke University';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'Y Combinator';
UPDATE young_company.institutions SET institution_name = 'University of California, Berkeley' WHERE institution_name = 'University of California, Berkeley';
UPDATE young_company.institutions SET institution_name = 'The New School' WHERE institution_name = 'High School';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'Oakland Military Institute';
UPDATE young_company.institutions SET institution_name = 'V. N. Karazin Kharkiv National University' WHERE institution_name = 'V. N. Karazin Kharkiv National University';
UPDATE young_company.institutions SET institution_name = 'Mississippi State University' WHERE institution_name = 'Mississippi Gulf Coast Community College';
UPDATE young_company.institutions SET institution_name = 'University of California, San Diego' WHERE institution_name = 'University of California, San Diego';
UPDATE young_company.institutions SET institution_name = 'City University of Hong Kong' WHERE institution_name = 'City University of Hong Kong';
UPDATE young_company.institutions SET institution_name = 'Politecnico di Milano' WHERE institution_name = 'Politecnico di Milano';
UPDATE young_company.institutions SET institution_name = 'University of California, Irvine' WHERE institution_name = 'University of California, Irvine';
UPDATE young_company.institutions SET institution_name = 'Indian Institute of Technology Guwahati' WHERE institution_name = 'Indian Institute of Technology, Guwahati';
UPDATE young_company.institutions SET institution_name = 'University of Minnesota Twin Cities' WHERE institution_name = 'University of Minnesota';
UPDATE young_company.institutions SET institution_name = 'Harvard University' WHERE institution_name = 'Harvard Business School Online';
UPDATE young_company.institutions SET institution_name = 'Syracuse University' WHERE institution_name = 'Syracuse University';
UPDATE young_company.institutions SET institution_name = 'Princeton University' WHERE institution_name = 'Princeton University';
UPDATE young_company.institutions SET institution_name = 'University of Michigan-Ann Arbor' WHERE institution_name = 'University of Michigan-Ann Arbor';
UPDATE young_company.institutions SET institution_name = 'The New School' WHERE institution_name = 'The Harker School';
UPDATE young_company.institutions SET institution_name = 'Harvard University' WHERE institution_name = 'Harvard University';
UPDATE young_company.institutions SET institution_name = 'University of Colorado Boulder' WHERE institution_name = 'University of Colorado Boulder';
UPDATE young_company.institutions SET institution_name = 'University of Pittsburgh' WHERE institution_name = 'University of Pittsburgh';
UPDATE young_company.institutions SET institution_name = 'London Metropolitan University' WHERE institution_name = 'University College London';
UPDATE young_company.institutions SET institution_name = 'National University of Singapore' WHERE institution_name = 'National University of Singapore';
UPDATE young_company.institutions SET institution_name = 'Georgia Institute of Technology' WHERE institution_name = 'Georgia Institute of Technology';
UPDATE young_company.institutions SET institution_name = 'Columbia University' WHERE institution_name = 'Columbia University';
UPDATE young_company.institutions SET institution_name = 'University of Pennsylvania' WHERE institution_name = 'University of Pennsylvania';
UPDATE young_company.institutions SET institution_name = 'University of Idaho' WHERE institution_name = 'Nichols School';
UPDATE young_company.institutions SET institution_name = 'Carnegie Mellon University' WHERE institution_name = 'Carnegie Mellon University';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'Coursera';
UPDATE young_company.institutions SET institution_name = 'Yale University' WHERE institution_name = 'Yale University';
UPDATE young_company.institutions SET institution_name = 'Universidad Anáhuac México' WHERE institution_name = 'Universidad Iberoamericana, Ciudad de México';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'Vista hermosa';
UPDATE young_company.institutions SET institution_name = 'Universidad Iberoamericana IBERO' WHERE institution_name = 'Universidad Iberoamericana';
UPDATE young_company.institutions SET institution_name = 'The University of Auckland' WHERE institution_name = 'The University of Auckland';
UPDATE young_company.institutions SET institution_name = 'Stanford University' WHERE institution_name = 'Stanford University Graduate School of Business';
UPDATE young_company.institutions SET institution_name = 'Emory University' WHERE institution_name = 'Bellarmine College Preparatory';
UPDATE young_company.institutions SET institution_name = 'Nanyang Technological University, Singapore' WHERE institution_name = 'Nanyang Technological University, Singapore';
UPDATE young_company.institutions SET institution_name = 'University of Waterloo' WHERE institution_name = 'University of Waterloo';
UPDATE young_company.institutions SET institution_name = 'University of Illinois at Urbana-Champaign' WHERE institution_name = 'University of Illinois at Urbana-Champaign';
UPDATE young_company.institutions SET institution_name = 'University of California, Berkeley' WHERE institution_name = 'UC Berkeley College of Engineering';
UPDATE young_company.institutions SET institution_name = 'University of Oxford' WHERE institution_name = 'University of Oxford';
UPDATE young_company.institutions SET institution_name = 'The University of Georgia' WHERE institution_name = 'The University of Georgia';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'St. Columba''s School';
UPDATE young_company.institutions SET institution_name = 'Rochester Institute of Technology' WHERE institution_name = 'Rochester Institute of Technology';
UPDATE young_company.institutions SET institution_name = 'Imperial College London' WHERE institution_name = 'Imperial College London';
UPDATE young_company.institutions SET institution_name = 'Indian Institute of Technology Bombay' WHERE institution_name = 'IIT Bombay';
UPDATE young_company.institutions SET institution_name = 'University of Madras' WHERE institution_name = 'University of Madras';
UPDATE young_company.institutions SET institution_name = 'Dartmouth College' WHERE institution_name = 'Tuck School of Business at Dartmouth';
UPDATE young_company.institutions SET institution_name = 'Savitribai Phule Pune University' WHERE institution_name = 'Savitribai Phule Pune University';
UPDATE young_company.institutions SET institution_name = 'National Institute of Technology Tiruchirappalli' WHERE institution_name = 'National Institute of Technology Tiruchirappalli';
UPDATE young_company.institutions SET institution_name = 'Universitas Muhammadiyah Yogyakarta' WHERE institution_name = 'Kendriya Vidyalaya';
UPDATE young_company.institutions SET institution_name = 'Birla Institute of Technology and Science, Pilani' WHERE institution_name = 'Birla Institute of Technology';
UPDATE young_company.institutions SET institution_name = 'The New School' WHERE institution_name = 'The Hotchkiss School';
UPDATE young_company.institutions SET institution_name = 'Northwestern University' WHERE institution_name = 'Northwestern University';
UPDATE young_company.institutions SET institution_name = 'University of Texas at Austin' WHERE institution_name = 'University of Texas at Austin';
UPDATE young_company.institutions SET institution_name = 'Aarhus University' WHERE institution_name = 'Aarhus University';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'IT';
UPDATE young_company.institutions SET institution_name = 'Tufts University' WHERE institution_name = 'Tufts University';
UPDATE young_company.institutions SET institution_name = 'Belarusian State University' WHERE institution_name = 'Belarusian State University';
UPDATE young_company.institutions SET institution_name = 'Sabanci University' WHERE institution_name = 'Dhirubhai Ambani International School';
UPDATE young_company.institutions SET institution_name = 'Harvard University' WHERE institution_name = 'Harvard Business School';
UPDATE young_company.institutions SET institution_name = 'Indian Institute of Technology Delhi' WHERE institution_name = 'IIT Delhi';
UPDATE young_company.institutions SET institution_name = 'National Institute of Technology Tiruchirappalli' WHERE institution_name = 'National Institute of Technology, Kurukshetra';
UPDATE young_company.institutions SET institution_name = 'Indian Institute of Technology Roorkee' WHERE institution_name = 'IIT Roorkee';
UPDATE young_company.institutions SET institution_name = 'Yerevan State University' WHERE institution_name = 'State Engineering University of Armenia';
UPDATE young_company.institutions SET institution_name = 'Carnegie Mellon University' WHERE institution_name = 'Carnegie Mellon University College of Engineering';
UPDATE young_company.institutions SET institution_name = 'The University of Queensland' WHERE institution_name = 'The University of Queensland';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'Humber College';
UPDATE young_company.institutions SET institution_name = 'Tecnológico de Monterrey' WHERE institution_name = 'Tecnológico de Monterrey';
UPDATE young_company.institutions SET institution_name = 'Royal Holloway University of London' WHERE institution_name = 'Royal Holloway University of London';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'HEC Paris';
UPDATE young_company.institutions SET institution_name = 'Hongik University ' WHERE institution_name = 'HKUST Business School';
UPDATE young_company.institutions SET institution_name = 'Western University' WHERE institution_name = 'Ivey Business School at Western University';
UPDATE young_company.institutions SET institution_name = 'Fordham University ' WHERE institution_name = 'Claremont Colleges';
UPDATE young_company.institutions SET institution_name = 'University of British Columbia' WHERE institution_name = 'The University of British Columbia';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'Rock Health';
UPDATE young_company.institutions SET institution_name = 'Michigan State University' WHERE institution_name = 'Michigan State University';
UPDATE young_company.institutions SET institution_name = 'University of San Diego' WHERE institution_name = 'University of San Diego';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'CentraleSupélec';
UPDATE young_company.institutions SET institution_name = 'École Normale Supérieure de Lyon' WHERE institution_name = 'Ecole normale supérieure';
UPDATE young_company.institutions SET institution_name = 'Simon Fraser University' WHERE institution_name = 'Simon Fraser University';
UPDATE young_company.institutions SET institution_name = 'Waseda University' WHERE institution_name = 'Waseda University';
UPDATE young_company.institutions SET institution_name = 'Manchester Metropolitan University' WHERE institution_name = 'Manchester Metropolitan University';
UPDATE young_company.institutions SET institution_name = 'University of Alberta' WHERE institution_name = 'University of Alberta';
UPDATE young_company.institutions SET institution_name = 'University of Washington' WHERE institution_name = 'University of Washington';
UPDATE young_company.institutions SET institution_name = 'University of Southern California' WHERE institution_name = 'University of Southern California';
UPDATE young_company.institutions SET institution_name = 'Purdue University' WHERE institution_name = 'Purdue University';
UPDATE young_company.institutions SET institution_name = 'Queen''s University Belfast' WHERE institution_name = 'Queen''s University Belfast';
UPDATE young_company.institutions SET institution_name = 'University of Cambridge' WHERE institution_name = 'University of Cambridge';
UPDATE young_company.institutions SET institution_name = 'University of Tyumen' WHERE institution_name = 'College of Engineering Trivandrum';
UPDATE young_company.institutions SET institution_name = 'Indian Institute of Technology Kanpur' WHERE institution_name = 'IIT Kanpur';
UPDATE young_company.institutions SET institution_name = 'Universitas Muhammadiyah Yogyakarta' WHERE institution_name = 'Jawahar Navodaya Vidyalaya, Birauli, Samastipur';
UPDATE young_company.institutions SET institution_name = 'Universitas Muhammadiyah Yogyakarta' WHERE institution_name = 'Kendriya Vidyala, Andrews Ganj';
UPDATE young_company.institutions SET institution_name = 'Guru Gobind Singh Indraprastha University' WHERE institution_name = 'Guru Gobind Singh Indraprastha University';
UPDATE young_company.institutions SET institution_name = 'University of Engineering & Technology Lahore' WHERE institution_name = 'RV College Of Engineering';
UPDATE young_company.institutions SET institution_name = 'Indian Institute of Technology Kanpur' WHERE institution_name = 'Indian School of Business';
UPDATE young_company.institutions SET institution_name = 'IE University' WHERE institution_name = 'IE Business School';
UPDATE young_company.institutions SET institution_name = 'Pondicherry University' WHERE institution_name = 'Pondicherry University';
UPDATE young_company.institutions SET institution_name = 'Pondicherry University' WHERE institution_name = 'Pondicherry Engineering College';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'St. Joseph''s Convent School, Pathankot';
UPDATE young_company.institutions SET institution_name = 'Stanford University' WHERE institution_name = 'Stanford Continuing Studies';
UPDATE young_company.institutions SET institution_name = 'Illinois Institute of Technology' WHERE institution_name = 'International Institute of Information Technology';
UPDATE young_company.institutions SET institution_name = 'Indian Institute of Science' WHERE institution_name = 'Indian Institute of Science';
UPDATE young_company.institutions SET institution_name = 'University of Toronto' WHERE institution_name = 'University of Toronto';
UPDATE young_company.institutions SET institution_name = 'University of Strathclyde' WHERE institution_name = 'Strathcona';
UPDATE young_company.institutions SET institution_name = 'The New School' WHERE institution_name = 'Crescent School';
UPDATE young_company.institutions SET institution_name = 'University of Ottawa' WHERE institution_name = 'University of Ottawa';
UPDATE young_company.institutions SET institution_name = 'Institut National des Sciences Appliquées de Lyon' WHERE institution_name = 'Institut National des Sciences Appliquées de Lyon';
UPDATE young_company.institutions SET institution_name = 'University of Nottingham' WHERE institution_name = 'Nottingham';
UPDATE young_company.institutions SET institution_name = 'New York University' WHERE institution_name = 'New York University';
UPDATE young_company.institutions SET institution_name = 'Robert Gordon University' WHERE institution_name = 'Gordonstoun School';
UPDATE young_company.institutions SET institution_name = 'Newcastle University' WHERE institution_name = 'Newcastle University';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'Lycee International de St. Germain';
UPDATE young_company.institutions SET institution_name = 'Fundación CEU San Pablo' WHERE institution_name = 'FGV - Fundação Getulio Vargas';
UPDATE young_company.institutions SET institution_name = 'Colegio de México' WHERE institution_name = 'Colégio Bandeirantes';
UPDATE young_company.institutions SET institution_name = 'Massachusetts Institute of Technology ' WHERE institution_name = 'Massachusetts Institute of Technology';
UPDATE young_company.institutions SET institution_name = 'Université Sorbonne Paris Nord' WHERE institution_name = 'Ecole Centrale Paris';
UPDATE young_company.institutions SET institution_name = 'Taras Shevchenko National University of Kyiv' WHERE institution_name = 'Taras Shevchenko National University of Kyiv';
UPDATE young_company.institutions SET institution_name = 'Norwegian University of Life Sciences' WHERE institution_name = 'Norwegian University of Life Sciences';
UPDATE young_company.institutions SET institution_name = 'CUNY The City College of New York' WHERE institution_name = 'CUNY Hunter College';
UPDATE young_company.institutions SET institution_name = 'Universität Leipzig' WHERE institution_name = 'Rigas Tehniska Universitate';
UPDATE young_company.institutions SET institution_name = 'De Montfort University' WHERE institution_name = 'Université de Technologie de Belfort-Montbéliard';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'ESMT';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'UTBM';
UPDATE young_company.institutions SET institution_name = 'San Francisco State University' WHERE institution_name = 'San Jose State University';
UPDATE young_company.institutions SET institution_name = 'Cornell University' WHERE institution_name = 'Cornell University';
UPDATE young_company.institutions SET institution_name = 'Indiana University Bloomington' WHERE institution_name = 'Indiana University Bloomington';
UPDATE young_company.institutions SET institution_name = 'Howard University' WHERE institution_name = 'Williams College';
UPDATE young_company.institutions SET institution_name = 'None' WHERE institution_name = 'Commercial Real Estate';
UPDATE young_company.institutions SET institution_name = 'Pennsylvania State University' WHERE institution_name = 'Penn State University';
UPDATE young_company.institutions SET institution_name = 'University College Cork' WHERE institution_name = 'University College Cork';
UPDATE young_company.institutions SET institution_name = 'University of New Hampshire' WHERE institution_name = 'University of New Hampshire';
UPDATE young_company.institutions SET institution_name = 'University of Southern California' WHERE institution_name = 'California College of the Arts';

#### University Program Mapping

##### this section applys topic generation and top modelling to the university study programs of the founders.

In [4]:
df = pd.read_csv('programs_founder.csv', header=None)
df = df.rename(columns={0: "index", 1: "program_name"})

# Step 1: Text vectorization
vectorizer = TfidfVectorizer(stop_words='english')
X = vectorizer.fit_transform(df['program_name'])

# Step 2: Dimensionality reduction for speedup
# Reducing TF-IDF dimensionality with TruncatedSVD
svd = TruncatedSVD(n_components=100, random_state=42)
X_reduced = svd.fit_transform(X)

# Step 3: Clustering with reduced dimensions
num_clusters = 50
kmeans = KMeans(n_clusters=num_clusters, random_state=42)
df['Cluster'] = kmeans.fit_predict(X_reduced)

# Reducing dimensions for visualization using SVD instead of PCA for speed
X_pca = TruncatedSVD(n_components=2, random_state=42).fit_transform(X_reduced)
df['PCA1'] = X_pca[:, 0]
df['PCA2'] = X_pca[:, 1]

sample_clusters = np.random.choice(df['Cluster'].unique(), 10, replace=False)

for cluster in sample_clusters:
    print(f"\nCluster {cluster + 1}:")
    print(df[df['Cluster'] == cluster]['program_name'].sample(3, random_state=42).values)

/Users/susanliang/opt/anaconda3/envs/nlp/lib/python3.12/site-packages/sklearn/cluster/_kmeans.py:1412: FutureWarning: The default value of `n_init` will change from 10 to 'auto' in 1.4. Set the value of `n_init` explicitly to suppress the warning
  super()._check_params_vs_input(X, default_n_init=10)

Cluster 6:
['Mathematics' 'Mathematics And Computer Science'
 'Engineering Mathematics']

Cluster 45:
['Industrial And Management Engineering'
 'Econometrics, Industrial Economics' 'Industrial Design, Daap']

Cluster 7:
['Engineering, Applied Mathematics'
 'Bachelor Of Applied Science Computer Engineering'
 'Applied Economics And Management']

Cluster 22:
['Physics, Math' 'Math And Physics' 'Chinese And Math']

Cluster 11:
['Applied Operations Research'
 'Operations Research, Financial Engineering'
 'Operations Research And Industrial Engineering']

Cluster 48:
['Information Systems And Tools For New Media'
 'Business Honors And Management Information Systems, Elements Of Computing Certificate'
 'Information Management And Systems']

Cluster 26:
['International Studies, Focus On Brazil / Portuguese Language'
 'International Baccalaureate' 'International Middle School']

Cluster 34:
['Economics And Finance, Minor In Statistics'
 'Honours Mathematics, Statistics Major' 'Statistics, Mathematics']

Cluster 28:
['Machine Intelligence' 'Biomedical Engineering With Machine Learning'
 'Mathematics, Computer Vision, Machine Learning']

Cluster 23:
['Computer Engineering Computer Science' 'Electrical Computer Engineering'
 'Electrical Engineering, Computer Science, Management']

##### We take the 50 cluster output from above to chatGPT using GPT -4o model with the prompts as follows:

`create 15 names of those 50 clusters, such as computer science, mathemetics, .... that will be further cosine similarity friendly`

##### Then, I create a excel table from the GenAI tag generation result

##### Now, I use LLM transformer to tag the university study programs into those 15 tags

In [11]:
model = SentenceTransformer('sentence-transformers/all-MiniLM-L6-v2')
programs_df = df[['index', 'program_name']]  
categories_df = pd.read_excel('program_category_output.xlsx') 
category_embeddings = model.encode(categories_df['Program_Category'].tolist(), convert_to_tensor=True)
assigned_categories = []
for program_name in tqdm(programs_df['program_name'], desc="Classifying programs"):
    program_embedding = model.encode(program_name, convert_to_tensor=True)
    similarities = util.pytorch_cos_sim(program_embedding, category_embeddings)
    best_match_idx = int(similarities.argmax())
    best_category = categories_df.iloc[best_match_idx]['Program_Category']
    assigned_categories.append(best_category)
programs_df['category'] = assigned_categories

Classifying programs: 100%|██████████| 3388/3388 [00:51<00:00, 65.71it/s]
/var/folders/wr/956qfj8n0nd7qf20gnbgf5qw0000gn/T/ipykernel_45792/4007075045.py:22: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  programs_df['category'] = assigned_categories

In [13]:
# programs_df.to_csv('mapping_program_category.csv')